3) Descriptive Statistics - Measures of Central Tendency and variability
Perform the following operations on any open source dataset (e.g., data.csv)
1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a 
Curriculum for Third Year of Artificial Intelligence and Data Science (2019 Course), Savitribai Phule Pune University
http://collegecirculars.unipune.ac.in/sites/documents/Syllabus2022/Forms/AllItems.aspx #84/105
dataset (age, income etc.) with numeric variables grouped by one of the qualitative 
(categorical) variable. For example, if your categorical variable is age groups and quantitative 
variable is income, then provide summary statistics of income grouped by the age groups. 
Create a list that contains a numeric value for each response to the categorical variable.
2. Write a Python program to display some basic statistical details like percentile, mean, 
standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-versicolor’ of 
iris.csv dataset.
Provide the codes with outputs and explain everything that you do in this step.

In [3]:
import numpy as np
import pandas as pd

In [4]:
df=pd.read_csv('Employee.csv')

In [5]:
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [6]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [7]:
df.tail()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [8]:
# Assuming df is your DataFrame
numeric_mean = df.mean(numeric_only=True)
print(numeric_mean)

JoiningYear                  2015.062970
PaymentTier                     2.698259
Age                            29.393295
ExperienceInCurrentDomain       2.905652
LeaveOrNot                      0.343864
dtype: float64

In [9]:
df.dtypes

Education                    object
JoiningYear                   int64
City                         object
PaymentTier                   int64
Age                           int64
Gender                       object
EverBenched                  object
ExperienceInCurrentDomain     int64
LeaveOrNot                    int64
dtype: object

In [10]:
df.loc[:,'Age'].mean()

29.393294648613796

In [11]:
numeric_columns = df.select_dtypes(include='int64')
row_means = numeric_columns.mean(axis=1)
print(row_means[:4])  # Printing mean for the first four rows

0    410.8
1    409.2
2    411.4
3    410.4
dtype: float64

In [12]:
# Assuming df is your DataFrame
numeric_median = df.median(numeric_only=True)
print(numeric_median)

JoiningYear                  2015.0
PaymentTier                     3.0
Age                            28.0
ExperienceInCurrentDomain       3.0
LeaveOrNot                      0.0
dtype: float64

In [13]:
df.loc[:,'Age'].median()

28.0

In [14]:
numeric_columns = df.select_dtypes(include='int64')
row_median = numeric_columns.median(axis=1)
print(row_median[:4])  # Printing median for the first four rows

0    3.0
1    3.0
2    3.0
3    5.0
dtype: float64

In [15]:
df.mode()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,26,Male,No,2,0

In [16]:
df.loc[:,'Age'].mode()

0    26
Name: Age, dtype: int64

In [17]:
df.min()

Education                    Bachelors
JoiningYear                       2012
City                         Bangalore
PaymentTier                          1
Age                                 22
Gender                          Female
EverBenched                         No
ExperienceInCurrentDomain            0
LeaveOrNot                           0
dtype: object

In [18]:
df.loc[:,'Age'].min(skipna=False)

22

In [19]:
df.max()

Education                     PHD
JoiningYear                  2018
City                         Pune
PaymentTier                     3
Age                            41
Gender                       Male
EverBenched                   Yes
ExperienceInCurrentDomain       7
LeaveOrNot                      1
dtype: object

In [20]:
df.loc[:,'Age'].max(skipna=False)

41

In [21]:
numeric_columns = df.select_dtypes(include='int64')
numeric_std = numeric_columns.std()
print(numeric_std)

JoiningYear                  1.863377
PaymentTier                  0.561435
Age                          4.826087
ExperienceInCurrentDomain    1.558240
LeaveOrNot                   0.475047
dtype: float64

In [22]:
df.loc[:,'Age'].std()

4.826087009126047

In [23]:
numeric_columns = df.select_dtypes(include='int64')
row_std = numeric_columns.std(axis=1)
print(row_std[:4])  # Printing standard deviation for the first four rows

0    898.007628
1    896.624336
2    896.019419
3    897.618961
dtype: float64

In [24]:
df.groupby(['Gender'])['Age'].mean()

Gender
Female    29.41600
Male      29.37797
Name: Age, dtype: float64

In [25]:
data=df.rename(columns={'Salary':'Income'},inplace=False)

In [27]:
data.groupby(['Gender'])['PaymentTier'].mean()

Gender
Female    2.537600
Male      2.806695
Name: PaymentTier, dtype: float64

In [28]:
data

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

To create a list that contains a numeric value for each response to the categorical variables.

In [29]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df=pd.DataFrame(enc.fit_transform(df[['Gender']]).toarray())
enc_df

        0    1
0     0.0  1.0
1     1.0  0.0
2     1.0  0.0
3     0.0  1.0
4     0.0  1.0
...   ...  ...
4648  1.0  0.0
4649  0.0  1.0
4650  0.0  1.0
4651  0.0  1.0
4652  0.0  1.0

[4653 rows x 2 columns]

In [30]:
df_encode=data.join(enc_df)

In [31]:
df_encode

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot,0,1
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0,0.0,1.0
1,Bachelors,2013,Pune,1,28,Female,No,3,1,1.0,0.0
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0,1.0,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1,0.0,1.0
4,Masters,2017,Pune,3,24,Male,Yes,2,1,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0,1.0,0.0
4649,Masters,2013,Pune,2,37,Male,No,2,1,0.0,1.0
4650,Masters,2018,New Delhi,3,27,Male,No,5,1,0.0,1.0
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0,0.0,1.0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0,0.0,1.0

In [32]:
from sklearn import preprocessing
from sklearn.datasets import load_iris
iris= load_iris()

In [33]:
fd=pd.read_csv('iris.csv')

In [34]:
fd

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [35]:
seto=(fd['species']=='Iris-setosa')

In [36]:
print('Iris-setosa')

Iris-setosa

In [37]:
print(fd[seto].describe())

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [38]:
versi=(fd['species']=='Iris-versicolor')

In [39]:
print(fd[versi].describe())

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [40]:
vir=(fd['species']=='Iris-virginica')

In [41]:
print(fd[vir].describe())

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000